tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66j55_tdd.h
#define T4CKPS1                       522
#define TMR4ON                        523
#define T4OUTPS                       524
#define T4OUTPS0                      525
#define T4OUTPS1                      526
#define T4OUTPS2                      527
#define T4OUTPS3                      528
#define CVRCON                        529
#define CVR                           530
#define CVR0                          531
#define CVR1                          532
#define CVR2                          533
#define CVR3                          534
#define CVRSS                         535
#define CVRR                          536
#define CVROEN                        537
#define CVROE                         538
#define CVREN                         539
#define T3CON                         540
#define TMR3ON                        541
#define TMR3CS                        542
#define nT3SYNC                       543
#define NOT_T3SYNC                    544
#define T3SYNC                        545
#define T3INSYNC                      546
#define SOSCEN3                       547
#define T3CCP1                        548
#define T3CKPS                        549
#define T3CKPS0                       550
#define T3CKPS1                       551
#define T3CCP2                        552
#define T3CON_RD16                    553
#define RD163                         554
#define T3RD16                        555
#define BAUDCON2                      556
#define BAUDCON2_ABDEN                557
#define ABDEN2                        558
#define WUE2                          559
#define BAUDCON2_WUE                  560
#define BRG162                        561
#define BAUDCON2_BRG16                562
#define BAUDCON2_SCKP                 563
#define SCKP2                         564
#define BAUDCON2_TXCKP                565
#define TXCKP2                        566
#define DTRXP2                        567
#define RXDTP2                        568
#define BAUDCON2_DTRXP                569
#define BAUDCON2_RXDTP                570
#define RCMT2                         571
#define RCIDL2                        572
#define BAUDCON2_RCIDL                573
#define BAUDCON2_RCMT                 574
#define BAUDCON2_ABDOVF               575
#define ABDOVF2                       576
#define BAUDCON1                      577
#define BAUDCON1_ABDEN                578
#define ABDEN1                        579
#define BAUDCON1_WUE                  580
#define WUE1                          581
#define W4E                           582
#define BRG161                        583
#define BAUDCON1_BRG16                584
#define CKTXP                         585
#define BAUDCON1_TXCKP                586
#define SCKP1                         587
#define BAUDCON1_SCKP                 588
#define TXCKP1                        589
#define DTRXP1                        590
#define RXDTP1                        591
#define RXCKP                         592
#define BAUDCON1_DTRXP                593
#define BAUDCON1_RXDTP                594
#define BAUDCON1_RCMT                 595
#define RCMT1                         596
#define RCIDL1                        597
#define BAUDCON1_RCIDL                598
#define ABDOVF1                       599
#define BAUDCON1_ABDOVF               600
#define PORTA                         601
#define AN0                           602
#define ULPWUIN                       603
#define PORTA_RA0                     604
#define AN1                           605
#define PORTA_RA1                     606
#define AN2                           607
#define PORTA_RA2                     608
#define VREFM                         609
#define AN3                           610
#define PORTA_RA3                     611
#define VREFP                         612
#define PORTA_RA4                     613
#define T0CKI                         614
#define AN4                           615
#define PORTA_RA5                     616
#define LVDIN                         617
#define C2INA                         618
#define CLKO                          619
#define PORTA_RA6                     620
#define OSC2                          621
#define PORTA_RA7                     622
#define RJPU                          623
#define PORTB                         624
#define FLT0                          625
#define INT0                          626
#define PORTB_RB0                     627
#define PMA4                          628
#define INT1                          629
#define PORTB_RB1                     630
#define PMA3                          631
#define INT2                          632
#define PORTB_RB2                     633
#define PMA2                          634
#define INT3                          635
#define CCP2_PA2                      636
#define PORTB_RB3                     637
#define PMA1                          638
#define KBI0                          639
#define PORTB_RB4                     640
#define PMA0                          641
#define PGC                           642
#define KBI1                          643
#define PORTB_RB5                     644
#define PGD                           645
#define KBI2                          646
#define PORTB_RB6                     647
#define KBI3                          648
#define PORTB_RB7                     649
#define PORTC                         650
#define T13CKI                        651
#define T1OSO                         652
#define PORTC_RC0                     653
#define PORTC_CCP2                    654
#define T1OSI                         655
#define PA2                           656
#define PORTC_RC1                     657
#define CCP1                          658
#define PA1                           659
#define PORTC_RC2                     660
#define SCL                           661
#define SCK                           662
#define PORTC_RC3                     663
#define SDA                           664
#define SDI                           665
#define PORTC_RC4                     666
#define C2OUT                         667
#define SDO                           668
#define PORTC_RC5                     669
#define TX                            670
#define CK                            671
#define PORTC_RC6                     672
#define DT                            673
#define RX                            674
#define PORTC_RC7                     675
#define PORTD                         676
#define PORTD_RD0                     677
#define PMD0                          678
#define PORTD_RD1                     679
#define PMD1                          680
#define PORTD_RD2                     681
#define PMD2                          682
#define PORTD_RD3                     683
#define PMD3                          684
#define SDO2                          685
#define PORTD_RD4                     686
#define PMD4                          687
#define SDI2                          688
#define SDA2                          689
#define PORTD_RD5                     690
#define PMD5                          691
#define SCK2                          692
#define SCL2                          693
#define PORTD_RD6                     694
#define PMD6                          695
#define SS2                           696
#define PORTD_RD7                     697
#define PMD7                          698
#define PORTE                         699
#define PMRD                          700
#define PD2                           701
#define RDE                           702
#define PORTE_RE0                     703
#define PMWR                          704
#define WRE                           705
#define PORTE_RE1                     706
#define PC2                           707
#define PMBE                          708
#define CCP10                         709
#define PB2                           710
#define CS                            711
#define PORTE_RE2                     712
#define CCP9E                         713
#define PMA13                         714
#define REFO                          715
#define PORTE_RE3                     716
#define PC3E                          717
#define PB3E                          718
#define PMA12                         719
#define PORTE_RE4                     720
#define CCP8E                         721
#define PMA11                         722
#define CCP7E                         723
#define PORTE_RE5                     724
#define PC1E                          725
#define CCP6E                         726
#define PMA10                         727
#define PORTE_RE6                     728
#define PB1E                          729
#define PORTE_CCP2                    730
#define CCP2E                         731
#define PORTE_RE7                     732
#define PMA9                          733
#define PA2E                          734
#define PORTF                         735
#define PORTF_RF2                     736
#define AN7                           737
#define C2INB                         738
#define PMA5                          739
#define C1OUTF                        740
#define PORTF_RF3                     741
#define PORTF_RF4                     742
#define PORTF_RF5                     743
#define C1INB                         744
#define AN10                          745
#define CVREF                         746
#define C1INA                         747
#define PORTF_RF6                     748
#define AN11                          749
#define SS                            750
#define C1OUT                         751
#define PORTF_RF7                     752
#define PORTG                         753
#define PMA8                          754
#define CCP3                          755
#define PORTG_RG0                     756
#define PMA7                          757
#define C3OUTG                        758
#define TX2                           759
#define PORTG_RG1                     760
#define CK2                           761
#define PMA6                          762
#define RX2                           763
#define PORTG_RG2                     764
#define DT2                           765
#define PMCS1                         766
#define CCP4                          767
#define PORTG_RG3                     768
#define PMCS2                         769
#define CCP5                          770
#define PORTG_RG4                     771
#define REPU                          772
#define RG6                           773
#define RDPU                          774
#define RG7                           775
#define LATA                          776
#define LATA0                         777
#define LA0                           778
#define LATA1                         779
#define LA1                           780
#define LATA2                         781
#define LA2                           782
#define LATA3                         783
#define LA3                           784
#define LATA4                         785
#define LA4                           786
#define LATA5                         787
#define LA5                           788
#define LATA6                         789
#define LA6                           790
#define LATA7                         791
#define LA7                           792
#define LATB                          793
#define LB0                           794
#define LATB0                         795
#define LB1                           796
#define LATB1                         797
#define LB2                           798
#define LATB2                         799
#define LB3                           800
#define LATB3                         801
#define LB4                           802
#define LATB4                         803
#define LB5                           804
#define LATB5                         805
#define LB6                           806
#define LATB6                         807
#define LB7                           808
#define LATB7                         809
#define LATC                          810
#define LATC0                         811
#define LC0                           812
#define LATC1                         813
#define LC1                           814
#define LATC2                         815
#define LC2                           816
#define LATC3                         817
#define LC3                           818
#define LATC4                         819
#define LC4                           820
#define LATC5                         821
#define LC5                           822
#define LATC6                         823
#define LC6                           824
#define LATC7                         825
#define LC7                           826
#define LATD                          827
#define LATD0                         828
#define LD0                           829
#define LATD1                         830
#define LD1                           831
#define LATD2                         832
#define LD2                           833
#define LATD3                         834
#define LD3                           835
#define LATD4                         836
#define LD4                           837
#define LATD5                         838
#define LD5                           839
#define LATD6                         840
#define LD6                           841
#define LATD7                         842
#define LD7                           843
#define LATE                          844
#define LATE0                         845
#define LE0                           846
#define LATE1                         847
#define LE1                           848
#define LATE2                         849
#define LE2                           850
#define LATE3                         851
#define LE3                           852
#define LATE4                         853
#define LE4                           854
#define LATE5                         855
#define LE5                           856
#define LATE6                         857
#define LE6                           858
#define LATE7                         859
#define LE7                           860
#define LATF                          861
#define LF2                           862
#define LATF2                         863
#define LF3                           864
#define LATF3                         865
#define LF4                           866
#define LATF4                         867
#define LF5                           868
#define LATF5                         869
#define LF6                           870
#define LATF6                         871
#define LF7                           872
#define LATF7                         873
#define LATG                          874
#define LATG0                         875
#define LG0                           876
#define LATG1                         877
#define LG1                           878
#define LATG2                         879
#define LG2                           880
#define LATG3                         881
#define LG3                           882
#define LATG4                         883
#define LG4                           884
#define TRISA                         885
#define TRISA0                        886
#define TRISA_RA0                     887
#define TRISA1                        888
#define TRISA_RA1                     889
#define TRISA2                        890
#define TRISA_RA2                     891
#define TRISA3                        892
#define TRISA_RA3                     893
#define TRISA_RA4                     894
#define TRISA4                        895
#define TRISA_RA5                     896
#define TRISA5                        897
#define TRISA_RA6                     898
#define TRISA6                        899
#define TRISA_RA7                     900
#define TRISA7                        901
#define TRISB                         902
#define TRISB_RB0                     903
#define TRISB0                        904
#define TRISB_RB1                     905
#define TRISB1                        906
#define TRISB_RB2                     907
#define TRISB2                        908
#define TRISB_RB3                     909
#define TRISB3                        910
#define TRISB_RB4                     911
#define TRISB4                        912
#define TRISB_RB5                     913
#define TRISB5                        914
#define TRISB_RB6                     915
#define TRISB6                        916
#define TRISB_RB7                     917
#define TRISB7                        918
#define TRISC                         919
#define TRISC0                        920
#define TRISC_RC0                     921
#define TRISC1                        922
#define TRISC_RC1                     923
#define TRISC2                        924
#define TRISC_RC2                     925
#define TRISC3                        926
#define TRISC_RC3                     927
#define TRISC4                        928
#define TRISC_RC4                     929
#define TRISC5                        930
#define TRISC_RC5                     931
#define TRISC6                        932
#define TRISC_RC6                     933
#define TRISC7                        934
#define TRISC_RC7                     935
#define TRISD                         936
#define TRISD_RD0                     937
#define TRISD0                        938
#define TRISD_RD1                     939
#define TRISD1                        940
#define TRISD_RD2                     941
#define TRISD2                        942
#define TRISD_RD3                     943
#define TRISD3                        944
#define TRISD_RD4                     945
#define TRISD4                        946
#define TRISD_RD5                     947
#define TRISD5                        948
#define TRISD_RD6                     949
#define TRISD6                        950
#define TRISD_RD7                     951
#define TRISD7                        952
#define TRISE                         953
#define TRISE_RE0                     954
#define TRISE0                        955
#define TRISE1                        956
#define TRISE_RE1                     957
#define TRISE2                        958
#define TRISE_RE2                     959
#define TRISE_RE3                     960
#define TRISE3                        961
#define TRISE_RE4                     962
#define TRISE4                        963
#define TRISE_RE5                     964
#define TRISE5                        965
#define TRISE_RE6                     966
#define TRISE6                        967
#define TRISE_RE7                     968
#define TRISE7                        969
#define TRISF                         970
#define TRISF_RF2                     971
#define TRISF2                        972
#define TRISF_RF3                     973
#define TRISF3                        974
#define TRISF_RF4                     975
#define TRISF4                        976
#define TRISF_RF5                     977
#define TRISF5                        978
#define TRISF_RF6                     979
#define TRISF6                        980
#define TRISF7                        981
#define TRISF_RF7                     982
#define TRISG                         983
#define TRISG0                        984
#define TRISG_RG0                     985
#define TRISG1                        986
#define TRISG_RG1                     987
#define TRISG2                        988
#define TRISG_RG2                     989
#define TRISG_RG3                     990
#define TRISG3                        991
#define TRISG4                        992
#define TRISG_RG4                     993
#define OSCTUNE                       994
#define TUN0                          995
#define TUN1                          996
#define TUN2                          997
#define TUN3                          998
#define TUN4                          999
#define TUN5                          1000
#define PLLEN                         1001
#define INTSRC                        1002
#define RCSTA2                        1003
#define RCD82                         1004
#define RX9D2                         1005
#define RCSTA2_RCD8                   1006
#define RCSTA2_RX9D                   1007
#define RCSTA2_OERR                   1008
#define OERR2                         1009
#define FERR2                         1010
#define RCSTA2_FERR                   1011
#define ADDEN2                        1012
#define RCSTA2_ADDEN                  1013
#define RCSTA2_CREN                   1014
#define CREN2                         1015
#define SREN2                         1016
#define RCSTA2_SREN                   1017
#define RC92                          1018
#define RCSTA2_nRC8                   1019
#define RC8_92                        1020
#define RCSTA2_RX9                    1021
#define RCSTA2_NOT_RC8                1022
#define RCSTA2_RC9                    1023
#define RCSTA2_RC8_9                  1024
#define RX92                          1025
#define RCSTA2_SPEN                   1026
#define SPEN2                         1027
#define PIE1                          1028
#define TMR1IE                        1029
#define TMR2IE                        1030
#define CCP1IE                        1031
#define SSP1IE                        1032
#define SSPIE                         1033
#define TXIE                          1034
#define TX1IE                         1035
#define RC1IE                         1036
#define RCIE                          1037
#define ADIE                          1038
#define PSPIE                         1039
#define PMPIE                         1040
#define PIR1                          1041
#define TMR1IF                        1042
#define TMR2IF                        1043
#define CCP1IF                        1044
#define SSPIF                         1045
#define SSP1IF                        1046
#define TXIF                          1047
#define TX1IF                         1048
#define RCIF                          1049
#define RC1IF                         1050
#define ADIF                          1051
#define PSPIF                         1052
#define PMPIF                         1053
#define IPR1                          1054
#define TMR1IP                        1055
#define TMR2IP                        1056
#define CCP1IP                        1057
#define SSPIP                         1058
#define SSP1IP                        1059
#define TX1IP                         1060
#define TXIP                          1061
#define RCIP                          1062
#define RC1IP                         1063
#define ADIP                          1064
#define PMPIP                         1065
#define PSPIP                         1066
#define PIE2                          1067
#define CCP2IE                        1068
#define TMR3IE                        1069
#define LVDIE                         1070
#define BCL1IE                        1071
#define BCLIE                         1072
#define USBIE                         1073
#define CM1IE                         1074
#define CMIE                          1075
#define CM2IE                         1076
#define OSCFIE                        1077
#define PIR2                          1078
#define CCP2IF                        1079
#define TMR3IF                        1080
#define LVDIF                         1081
#define BCL1IF                        1082
#define BCLIF                         1083
#define USBIF                         1084
#define CM1IF                         1085
#define CMIF                          1086
#define CM2IF                         1087
#define OSCFIF                        1088
#define IPR2                          1089
#define CCP2IP                        1090
