tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66j55_tdd.h
#define TMR3IP                        1091
#define LVDIP                         1092
#define BCLIP                         1093
#define BCL1IP                        1094
#define USBIP                         1095
#define CM1IP                         1096
#define CM2IP                         1097
#define CMIP                          1098
#define OSCFIP                        1099
#define PIE3                          1100
#define CCP3IE                        1101
#define RXB0IE                        1102
#define RXBNIE                        1103
#define RXB1IE                        1104
#define CCP4IE                        1105
#define TXB0IE                        1106
#define CCP5IE                        1107
#define TXB1IE                        1108
#define TMR4IE                        1109
#define TXB2IE                        1110
#define TXBNIE                        1111
#define TX2IE                         1112
#define RC2IE                         1113
#define BCL2IE                        1114
#define SSP2IE                        1115
#define PIR3                          1116
#define CCP3IF                        1117
#define RXBNIF                        1118
#define CCP4IF                        1119
#define CCP5IF                        1120
#define TMR4IF                        1121
#define TXBNIF                        1122
#define TX2IF                         1123
#define RC2IF                         1124
#define BCL2IF                        1125
#define SSP2IF                        1126
#define IPR3                          1127
#define CCP3IP                        1128
#define CCP4IP                        1129
#define RXBNIP                        1130
#define CCP5IP                        1131
#define TMR4IP                        1132
#define TX2IP                         1133
#define TXBNIP                        1134
#define RC2IP                         1135
#define BCL2IP                        1136
#define SSP2IP                        1137
#define EECON1                        1138
#define WR                            1139
#define WREN                          1140
#define WRERR                         1141
#define FREE                          1142
#define WPROG                         1143
#define TXSTA2                        1144
#define TXSTA2_TXD8                   1145
#define TX9D2                         1146
#define TXSTA2_TX9D                   1147
#define TXD82                         1148
#define TRMT2                         1149
#define TXSTA2_TRMT                   1150
#define BRGH2                         1151
#define TXSTA2_BRGH                   1152
#define SENDB2                        1153
#define TXSTA2_SENDB                  1154
#define TXSTA2_SYNC                   1155
#define SYNC2                         1156
#define TXEN2                         1157
#define TXSTA2_TXEN                   1158
#define TX8_92                        1159
#define TX92                          1160
#define TXSTA2_TX9                    1161
#define TXSTA2_nTX8                   1162
#define TXSTA2_NOT_TX8                1163
#define TXSTA2_TX8_9                  1164
#define TXSTA2_CSRC                   1165
#define CSRC2                         1166
#define RCSTA1                        1167
#define RCSTA1_RX9D                   1168
#define RX9D1                         1169
#define RCSTA1_RCD8                   1170
#define RCSTA1_OERR                   1171
#define OERR1                         1172
#define RCSTA1_FERR                   1173
#define FERR1                         1174
#define RCSTA1_ADDEN                  1175
#define ADDEN1                        1176
#define RCSTA1_CREN                   1177
#define CREN1                         1178
#define SRENA                         1179
#define SREN1                         1180
#define RCSTA1_SREN                   1181
#define RCSTA1_NOT_RC8                1182
#define RCSTA1_RC9                    1183
#define RCSTA1_nRC8                   1184
#define RCSTA1_RC8_9                  1185
#define RCSTA1_RX9                    1186
#define RX91                          1187
#define RCSTA1_SPEN                   1188
#define SPEN1                         1189
#define TXSTA1                        1190
#define TX9D1                         1191
#define TXSTA1_TX9D                   1192
#define TXSTA1_TXD8                   1193
#define TRMT1                         1194
#define TXSTA1_TRMT                   1195
#define BRGH1                         1196
#define TXSTA1_BRGH                   1197
#define TXSTA1_SENDB                  1198
#define SENDB1                        1199
#define TXSTA1_SYNC                   1200
#define SYNC1                         1201
#define TXEN1                         1202
#define TXSTA1_TXEN                   1203
#define TX91                          1204
#define TXSTA1_NOT_TX8                1205
#define TXSTA1_TX8_9                  1206
#define TXSTA1_TX9                    1207
#define TXSTA1_nTX8                   1208
#define TXSTA1_CSRC                   1209
#define CSRC1                         1210
#define ECCP3CON                      1211
#define CCP3M                         1212
#define CCP3M0                        1213
#define CCP3M1                        1214
#define CCP3M2                        1215
#define CCP3M3                        1216
#define CCP3Y                         1217
#define DC3B                          1218
#define DC3B0                         1219
#define DC3B1                         1220
#define CCP3X                         1221
#define P3M                           1222
#define P3M0                          1223
#define P3M1                          1224
#define ECCP3DEL                      1225
#define ECCP3DEL_PDC0                 1226
#define P3DC0                         1227
#define ECCP3DEL_PDC                  1228
#define ECCP3DEL_PDC1                 1229
#define P3DC1                         1230
#define ECCP3DEL_PDC2                 1231
#define P3DC2                         1232
#define ECCP3DEL_PDC3                 1233
#define P3DC3                         1234
#define ECCP3DEL_PDC4                 1235
#define P3DC4                         1236
#define ECCP3DEL_PDC5                 1237
#define P3DC5                         1238
#define ECCP3DEL_PDC6                 1239
#define P3DC6                         1240
#define P3RSEN                        1241
#define ECCP3DEL_PRSEN                1242
#define ECCP3AS                       1243
#define ECCP3AS_PSSBD0                1244
#define PSS3BD0                       1245
#define ECCP3AS_PSSBD                 1246
#define ECCP3AS_PSSBD1                1247
#define PSS3BD1                       1248
#define ECCP3AS_PSSAC0                1249
#define PSS3AC0                       1250
#define ECCP3AS_PSSAC                 1251
#define ECCP3AS_PSSAC1                1252
#define PSS3AC1                       1253
#define ECCP3AS_ECCPAS0               1254
#define ECCP3AS_ECCPAS                1255
#define ECCP3AS0                      1256
#define ECCP3AS_ECCPAS1               1257
#define ECCP3AS1                      1258
#define ECCP3AS_ECCPAS2               1259
#define ECCP3AS2                      1260
#define ECCP3AS_ECCPASE               1261
#define ECCP3ASE                      1262
#define ECCP2CON                      1263
#define CCP2M                         1264
#define CCP2M0                        1265
#define CCP2M1                        1266
#define CCP2M2                        1267
#define CCP2M3                        1268
#define DC2B                          1269
#define DC2B0                         1270
#define CCP2Y                         1271
#define DC2B1                         1272
#define CCP2X                         1273
#define P2M                           1274
#define P2M0                          1275
#define P2M1                          1276
#define ECCP2DEL                      1277
#define P2DC0                         1278
#define ECCP2DEL_PDC0                 1279
#define ECCP2DEL_PDC                  1280
#define P2DC1                         1281
#define ECCP2DEL_PDC1                 1282
#define P2DC2                         1283
#define ECCP2DEL_PDC2                 1284
#define P2DC3                         1285
#define ECCP2DEL_PDC3                 1286
#define P2DC4                         1287
#define ECCP2DEL_PDC4                 1288
#define P2DC5                         1289
#define ECCP2DEL_PDC5                 1290
#define P2DC6                         1291
#define ECCP2DEL_PDC6                 1292
#define ECCP2DEL_PRSEN                1293
#define P2RSEN                        1294
#define ECCP2AS                       1295
#define ECCP2AS_PSSBD                 1296
#define ECCP2AS_PSSBD0                1297
#define PSS2BD0                       1298
#define ECCP2AS_PSSBD1                1299
#define PSS2BD1                       1300
#define PSS2AC0                       1301
#define ECCP2AS_PSSAC0                1302
#define ECCP2AS_PSSAC                 1303
#define ECCP2AS_PSSAC1                1304
#define PSS2AC1                       1305
#define ECCP2AS_ECCPAS                1306
#define ECCP2AS0                      1307
#define ECCP2AS_ECCPAS0               1308
#define ECCP2AS1                      1309
#define ECCP2AS_ECCPAS1               1310
#define ECCP2AS2                      1311
#define ECCP2AS_ECCPAS2               1312
#define ECCP2AS_ECCPASE               1313
#define ECCP2ASE                      1314
#define ECCP1CON                      1315
#define CCP1M0                        1316
#define CCP1M                         1317
#define CCP1M1                        1318
#define CCP1M2                        1319
#define CCP1M3                        1320
#define CCP1Y                         1321
#define DC1B                          1322
#define DC1B0                         1323
#define CCP1X                         1324
#define DC1B1                         1325
#define P1M                           1326
#define P1M0                          1327
#define P1M1                          1328
#define ECCP1DEL                      1329
#define P1DC0                         1330
#define ECCP1DEL_PDC0                 1331
#define ECCP1DEL_PDC                  1332
#define P1DC1                         1333
#define ECCP1DEL_PDC1                 1334
#define P1DC2                         1335
#define ECCP1DEL_PDC2                 1336
#define P1DC3                         1337
#define ECCP1DEL_PDC3                 1338
#define P1DC4                         1339
#define ECCP1DEL_PDC4                 1340
#define P1DC5                         1341
#define ECCP1DEL_PDC5                 1342
#define P1DC6                         1343
#define ECCP1DEL_PDC6                 1344
#define P1RSEN                        1345
#define ECCP1DEL_PRSEN                1346
#define ECCP1AS                       1347
#define ECCP1AS_PSSBD                 1348
#define ECCP1AS_PSSBD0                1349
#define PSS1BD0                       1350
#define ECCP1AS_PSSBD1                1351
#define PSS1BD1                       1352
#define ECCP1AS_PSSAC0                1353
#define PSS1AC0                       1354
#define ECCP1AS_PSSAC                 1355
#define ECCP1AS_PSSAC1                1356
#define PSS1AC1                       1357
#define ECCP1AS_ECCPAS0               1358
#define ECCP1AS_ECCPAS                1359
#define ECCP1AS0                      1360
#define ECCP1AS_ECCPAS1               1361
#define ECCP1AS1                      1362
#define ECCP1AS_ECCPAS2               1363
#define ECCP1AS2                      1364
#define ECCP1ASE                      1365
#define ECCP1AS_ECCPASE               1366
#define WDTCON                        1367
#define SWDTEN                        1368
#define SWDTE                         1369
#define ADSHR                         1370
#define DEVCFG                        1371
#define LVDSTAT                       1372
#define REGSLP                        1373
#define ANCON0                        1374
#define PCFGL                         1375
#define PCFG0                         1376
#define PCFG1                         1377
#define PCFG2                         1378
#define PCFG3                         1379
#define PCFG4                         1380
#define PCFG5                         1381
#define PCFG6                         1382
#define PCFG7                         1383
#define ADCON1                        1384
#define ADCS0                         1385
#define ADCS                          1386
#define ADCS1                         1387
#define ADCS2                         1388
#define ACQT0                         1389
#define ACQT                          1390
#define CHSN3                         1391
#define ACQT1                         1392
#define VCFG01                        1393
#define ACQT2                         1394
#define VCFG11                        1395
#define ADCON1_ADCAL                  1396
#define ADFM                          1397
#define ANCON1                        1398
#define PCFGH                         1399
#define PCFG8                         1400
#define PCFG9                         1401
#define PCFG10                        1402
#define PCFG11                        1403
#define PCFG12                        1404
#define PCFG13                        1405
#define PCFG14                        1406
#define PCFG15                        1407
#define ADCON0                        1408
#define ADON                          1409
#define GO_nDONE                      1410
#define NOT_DONE                      1411
#define GODONE                        1412
#define GO_DONE                       1413
#define DONE                          1414
#define GO                            1415
#define GO_NOT_DONE                   1416
#define CHS                           1417
#define CHS0                          1418
#define CHS1                          1419
#define CHS2                          1420
#define CHS3                          1421
#define VCFG                          1422
#define VCFG0                         1423
#define VCFG1                         1424
#define ADCON0_ADCAL                  1425
#define SSP1CON2                      1426
#define SEN1                          1427
#define SSP1CON2_SEN                  1428
#define ADMSK11                       1429
#define SSP1CON2_RSEN                 1430
#define RSEN1                         1431
#define SSP1CON2_ADMSK1               1432
#define SSP1CON2_PEN                  1433
#define ADMSK21                       1434
#define PEN1                          1435
#define SSP1CON2_ADMSK2               1436
#define ADMSK31                       1437
#define RCEN1                         1438
#define SSP1CON2_RCEN                 1439
#define SSP1CON2_ADMSK3               1440
#define SSP1CON2_ACKEN                1441
#define ACKEN1                        1442
#define ADMSK41                       1443
#define SSP1CON2_ADMSK4               1444
#define ACKDT1                        1445
#define ADMSK51                       1446
#define SSP1CON2_ACKDT                1447
#define SSP1CON2_ADMSK5               1448
#define SSP1CON2_ACKSTAT              1449
#define ACKSTAT1                      1450
#define GCEN1                         1451
#define SSP1CON2_GCEN                 1452
#define SSP1CON1                      1453
#define SSP1CON1_SSPM0                1454
#define SSPM01                        1455
#define SSP1CON1_SSPM                 1456
#define SSP1CON1_SSPM1                1457
#define SSPM11                        1458
#define SSP1CON1_SSPM2                1459
#define SSPM21                        1460
#define SSPM31                        1461
#define SSP1CON1_SSPM3                1462
#define SSP1CON1_CKP                  1463
#define CKP1                          1464
#define SSPEN1                        1465
#define SSP1CON1_SSPEN                1466
#define SSPOV1                        1467
#define SSP1CON1_SSPOV                1468
#define WCOL1                         1469
#define SSP1CON1_WCOL                 1470
#define SSP1STAT                      1471
#define BF1                           1472
#define SSP1STAT_BF                   1473
#define UA1                           1474
#define SSP1STAT_UA                   1475
#define SSP1STAT_R_NOT_W              1476
#define RW1                           1477
#define NOT_W                         1478
#define SSP1STAT_R                    1479
#define SSP1STAT_nW                   1480
#define RW                            1481
#define SSP1STAT_READ_WRITE           1482
#define SSP1STAT_nWRITE               1483
#define SSP1STAT_I2C_READ             1484
#define SSP1STAT_R_W                  1485
#define SSP1STAT_NOT_WRITE            1486
#define SSP1STAT_R_nW                 1487
#define SSP1STAT_S                    1488
#define START                         1489
#define START1                        1490
#define SSP1STAT_I2C_START            1491
#define STOP                          1492
#define SSP1STAT_P                    1493
#define STOP1                         1494
#define SSP1STAT_I2C_STOP             1495
#define SSP1STAT_D                    1496
#define SSP1STAT_D_NOT_A              1497
#define NOT_A                         1498
#define SSP1STAT_D_A                  1499
#define SSP1STAT_D_nA                 1500
#define SSP1STAT_NOT_ADDRESS          1501
#define SSP1STAT_nA                   1502
#define DA1                           1503
#define DA                            1504
#define SSP1STAT_nADDRESS             1505
#define SSP1STAT_I2C_DAT              1506
#define SSP1STAT_DATA_ADDRESS         1507
#define SSP1STAT_CKE                  1508
#define CKE1                          1509
#define SSP1STAT_SMP                  1510
#define SMP1                          1511
#define SSP1ADD                       1512
#define SSP1ADD_MSK0                  1513
#define MSK01                         1514
#define SSP1ADD_MSK1                  1515
#define MSK11                         1516
#define SSP1ADD_MSK2                  1517
#define MSK21                         1518
#define MSK31                         1519
#define SSP1ADD_MSK3                  1520
#define SSP1ADD_MSK4                  1521
#define MSK41                         1522
#define MSK51                         1523
#define SSP1ADD_MSK5                  1524
#define SSP1ADD_MSK6                  1525
#define MSK61                         1526
#define SSP1ADD_MSK7                  1527
#define MSK71                         1528
#define SSP1MSK                       1529
#define SSP1MSK_MSK0                  1530
#define SSP1MSK_MSK1                  1531
#define SSP1MSK_MSK2                  1532
#define SSP1MSK_MSK3                  1533
#define SSP1MSK_MSK4                  1534
#define SSP1MSK_MSK5                  1535
#define SSP1MSK_MSK6                  1536
#define SSP1MSK_MSK7                  1537
#define T2CON                         1538
#define T2CKPS0                       1539
#define T2CKPS                        1540
#define T2CKPS1                       1541
#define TMR2ON                        1542
#define T2OUTPS0                      1543
#define TOUTPS                        1544
#define T2OUTPS1                      1545
#define T2OUTPS2                      1546
#define T2OUTPS3                      1547
#define PR2                           1548
#define WM0                           1549
#define WM1                           1550
#define WAIT0                         1551
#define WAIT1                         1552
#define EBDIS                         1553
#define PADCFG1                       1554
#define PMPTL                         1555
#define PMPTTL                        1556
#define ODCON3                        1557
#define SPI1OD                        1558
#define SPI2OD                        1559
#define T1CON                         1560
#define TMR1ON                        1561
#define TMR1CS                        1562
#define NOT_T1SYNC                    1563
#define T1SYNC                        1564
#define nT1SYNC                       1565
#define T1INSYNC                      1566
#define T1OSCEN                       1567
#define SOSCEN                        1568
#define T1CKPS0                       1569
#define T1CKPS                        1570
#define T1CKPS1                       1571
#define T1RUN                         1572
#define T1RD16                        1573
#define T1CON_RD16                    1574
#define ODCON2                        1575
#define USART1OD                      1576
#define U1OD                          1577
#define U2OD                          1578
#define USART2OD                      1579
#define ODCON1                        1580
#define ECCP1OD                       1581
#define ECCP2OD                       1582
#define ECCP3OD                       1583
#define CCP4OD                        1584
#define CCP5OD                        1585
#define RCON                          1586
#define BOR                           1587
#define NOT_BOR                       1588
#define nBOR                          1589
#define POR                           1590
#define nPOR                          1591
#define NOT_POR                       1592
#define PD                            1593
#define nPD                           1594
#define NOT_PD                        1595
#define nTO                           1596
#define TO                            1597
#define NOT_TO                        1598
#define nRI                           1599
#define NOT_RI                        1600
#define RI                            1601
#define NOT_CM                        1602
#define CM                            1603
#define nCM                           1604
#define IPEN                          1605
#define CM2CON1                       1606
#define CM2CON1_C1CH0                 1607
#define CM2CON1_CCH                   1608
#define CM2CON1_CCH0                  1609
#define CCH02                         1610
#define C1CH02                        1611
#define CM2CON1_C1CH1                 1612
#define CCH12                         1613
#define C1CH12                        1614
#define CM2CON1_CCH1                  1615
#define CM2CON1_CREF                  1616
#define CREF2                         1617
#define EVPOL02                       1618
#define CM2CON1_EVPOL0                1619
#define CM2CON1_EVPOL                 1620
#define CM2CON1_EVPOL1                1621
#define EVPOL12                       1622
#define CM2CON1_CPOL                  1623
#define CPOL2                         1624
#define COE2                          1625
#define CM2CON1_COE                   1626
#define CM2CON1_CON                   1627
#define CON2                          1628
#define CM1CON1                       1629
#define CM1CON1_CCH0                  1630
#define CM1CON1_CCH                   1631
#define CCH01                         1632
#define CM1CON1_C1CH0                 1633
#define CM1CON1_CCH1                  1634
#define CCH11                         1635
#define CM1CON1_C1CH1                 1636
#define CM1CON1_CREF                  1637
#define CREF1                         1638
#define CM1CON1_EVPOL0                1639
#define EVPOL01                       1640
#define CM1CON1_EVPOL                 1641
#define CM1CON1_EVPOL1                1642
#define EVPOL11                       1643
#define CM1CON1_CPOL                  1644
#define CPOL1                         1645
#define COE1                          1646
#define CM1CON1_COE                   1647
#define CM1CON1_CON                   1648
