tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66j55_tdd.h
#define CON1                          1649
#define REFOCON                       1650
#define RODIV0                        1651
#define RODIV                         1652
#define RODIV1                        1653
#define RODIV2                        1654
#define RODIV3                        1655
#define ROSEL                         1656
#define ROSSLP                        1657
#define ROON                          1658
#define OSCCON                        1659
#define SCS0                          1660
#define SCS                           1661
#define SCS1                          1662
#define OSTS                          1663
#define IRCF                          1664
#define IRCF0                         1665
#define IRCF1                         1666
#define IRCF2                         1667
#define IDLEN                         1668
#define T0CON                         1669
#define T0PS                          1670
#define T0PS0                         1671
#define T0PS1                         1672
#define T0PS2                         1673
#define PSA                           1674
#define T0PS3                         1675
#define T0SE                          1676
#define T0CS                          1677
#define T08BIT                        1678
#define TMR0ON                        1679
#define STATUS                        1680
#define C                             1681
#define CARRY                         1682
#define DC                            1683
#define ZERO                          1684
#define Z                             1685
#define OV                            1686
#define OVERFLOW                      1687
#define N                             1688
#define NEGATIVE                      1689
#define INTCON3                       1690
#define INT1IF                        1691
#define INT1F                         1692
#define INT2IF                        1693
#define INT2F                         1694
#define INT3F                         1695
#define INT3IF                        1696
#define INT1E                         1697
#define INT1IE                        1698
#define INT2IE                        1699
#define INT2E                         1700
#define INT3E                         1701
#define INT3IE                        1702
#define INT1P                         1703
#define INT1IP                        1704
#define INT2IP                        1705
#define INT2P                         1706
#define INTCON2                       1707
#define RBIP                          1708
#define INT3IP                        1709
#define INT3P                         1710
#define TMR0IP                        1711
#define T0IP                          1712
#define INTEDG3                       1713
#define INTEDG2                       1714
#define INTEDG1                       1715
#define INTEDG0                       1716
#define RBPU                          1717
#define NOT_RBPU                      1718
#define nRBPU                         1719
#define INTCON                        1720
#define RBIF                          1721
#define INT0F                         1722
#define INT0IF                        1723
#define T0IF                          1724
#define TMR0IF                        1725
#define RBIE                          1726
#define INT0E                         1727
#define INT0IE                        1728
#define T0IE                          1729
#define TMR0IE                        1730
#define PEIE                          1731
#define PEIE_GIEL                     1732
#define GIEL                          1733
#define GIE_GIEH                      1734
#define GIE                           1735
#define GIEH                          1736
#define STKPTR0                       1737
#define STKPTR                        1738
#define SP0                           1739
#define STKPTR1                       1740
#define SP1                           1741
#define STKPTR2                       1742
#define SP2                           1743
#define SP3                           1744
#define STKPTR3                       1745
#define STKPTR4                       1746
#define SP4                           1747
#define STKUNF                        1748
#define STKOVF                        1749
#define STKFUL                        1750

#endif // _PIC18F66J55_H_
